Revit 2024 API
MEPFamilyConnectorInfo Class
 MEP family connector information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class MEPFamilyConnectorInfo : MEPConnectorInfo
Visual Basic
Public Class MEPFamilyConnectorInfo _
	Inherits MEPConnectorInfo
Visual C++
public ref class MEPFamilyConnectorInfo : public MEPConnectorInfo
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPConnectorInfo
 Autodesk.Revit.DB.MEPFamilyConnectorInfo
See Also
MEPFamilyConnectorInfo Members
Autodesk.Revit.DB Namespace